Revit 2027 API
CableType.InsulationMaterial Property
 The Conductor Insulation Material of this Cable Type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId InsulationMaterial { get; set; }
Public Property InsulationMaterial As ElementId
	Get
	Set
public:
property ElementId^ InsulationMaterial {
	ElementId^ get ();
	void set (ElementId^ value);
}
member InsulationMaterial : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The id is not a Conductor Insulation Material id nor invalidElementId.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
CableType Class
Autodesk.Revit.DB.Electrical Namespace